apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The socket's receive queue, in datagrams. IDF defaults to 6 and the boot
# banner prints it as `udp mbox: 6`.
#
# Raised on the satellite first, where the case was obvious: one socket taking
# ~136 datagrams a second through a six-deep queue is 44 ms of headroom, and
# whatever lwIP cannot hand over in 44 ms it discards silently.
#
# The hub's case is quieter and slower to see, which is why it was nearly left
# alone. This socket carries only time probes and splice reports -- four probes
# a second per satellite -- so at one satellite six deep is 1.5 s of slack and
# nothing could plausibly overflow it.
#
# It does not stay that way. The rate scales with the floor: at MAX_CLIENTS = 8
# it is 32 datagrams a second and under 200 ms of headroom, from eight units
# free-running on independent 250 ms timers whose probes will sometimes arrive
# together. probe_task serves this socket at priority 6, below playback and the
# sync monitor.
#
# What makes it worth the bytes rather than merely tidy is the FAILURE MODE. A
# probe lost in this queue is indistinguishable from a satellite that stopped
# probing, and CLIENT_TIMEOUT_US is 2 s -- eight probes. Lose enough and the hub
# forgets a satellite that is sitting right there, drops it from the send list,
# and stops sending it audio until its next probe gets through. That is a silent
# speaker, reported as sta-timeout, and no counter anywhere would say the
# difference.
#
# 32 matches the satellite, so there is one number for this on the floor rather
# than two.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# 50% overlap between analysis windows. The window stays 1024; this is only how
# far the analysis advances between them.
#
# Pinned here for the reason it is pinned on the classic hub and on the
# satellite: a hop mismatch across a floor is the expensive bug, and this build
# makes one MORE likely rather than less, because it is the first unit on the
# floor whose config is not a copy of the others'. Both flux floors and the beat
# history were swept against 206 recordings at 512 -- see docs/tuning-corpus.md.
CONFIG_DANCEFLOOR_LED_HOP_512=y

# The pattern the floor runs, which is a floor-wide agreement and not a per-unit
# preference: two units on different patterns are not comparable by eye, and the
# eye is the only instrument most of this project has.
#
# Pinned here for the same reason the hop above is, and this build is the one
# that proved the reason. The Kconfig default is "pulse"; this floor runs
# "boom"; sdkconfig is gitignored, so the "boom" on the classic hub and the
# satellite lived only in untracked files and did not come across. The first S3
# hub therefore came up cycling a 28-second hue against its neighbours' fixed
# amber, and the immediate reading of that was a sync fault.
#
# Cheaper than a hop mismatch, which is invisible -- this one is obvious the
# moment the strips are side by side. It is still worth a tracked line, because
# what it looks like is the expensive thing rather than what it is.
CONFIG_DANCEFLOOR_LED_PATTERN="boom"

# ---------------------------------------------------------------------------
# Pin map: Seeed Studio XIAO ESP32-S3 (Sense)
# ---------------------------------------------------------------------------
#
# The board breaks out eleven GPIOs, D0-D10, and nothing else:
#
#   D0=1  D1=2  D2=3  D3=4  D4=5  D5=6  D6=43(TX)  D7=44(RX)
#   D8=7(SCK)  D9=8(MISO)  D10=9(MOSI)
#
# The hub wants seven of them, so the map below is not one arrangement among
# many -- it is close to the only one. What is left over is D1, D2, D5 and D6.
#
# None of the classic hub's numbers carry over except the marker. 23 and 25 do
# not exist on this part; 26 and 27 do, but are wired to the SPI flash.
#
# On the Sense variant the camera and PDM microphone hang off the B2B connector
# on GPIOs that are not broken out (the mic is 42/41), so they take nothing from
# this list. The SD slot may: it is reportedly on the same D8/D9/D10 SPI pads
# the I2S output uses below, with GPIO 21 for CS. Unverified against the
# schematic, and irrelevant unless you want the card -- but do not assume the
# two coexist without checking.
#
# None of it gives anything either. Every one of them is dead weight for a hub,
# which analyses the synchronised stream and deliberately never listens to a
# room (architecture.md S12).

# I2S to the PCM5102A, on the three SPI-labelled pads so the DAC is one ribbon
# off the end of the header. This chip is the I2S master.
CONFIG_DANCEFLOOR_I2S_BCK_PIN=7
CONFIG_DANCEFLOOR_I2S_LRCK_PIN=8
CONFIG_DANCEFLOOR_I2S_DATA_PIN=9

# One wire in from the bridge chip. D7, the pad silkscreened RX.
CONFIG_DANCEFLOOR_SBC_UART_RX_PIN=44

# WS2812 data, still via the 74AHCT125 -- the S3 drives 3.3 V exactly as the
# classic ESP32 does, so the level shifter is no less necessary here. Driven
# through SPI2_HOST and the GPIO matrix, which is fine at the ~2.4 MHz the
# WS2812 encoding needs. Never RMT: see architecture.md S12.
CONFIG_DANCEFLOOR_LED_GPIO=1

# The bench marker pins are NOT set here, on purpose.
#
# DANCEFLOOR_MARKER_GPIO and DANCEFLOOR_MONITOR_GPIO both depend on
# DANCEFLOOR_ENABLE_MARKER, which is off, so they are invisible when this file
# is applied and any value given for them here is silently discarded. Enabling
# the marker later would then fall back to the Kconfig defaults -- and the
# classic hub's monitor pin, 21, is this board's onboard LED rather than a pad.
#
# The marker stays at 4 (D3), which is the one number that survived the move.
# The monitor default is 5 (D4), set in main/Kconfig.projbuild where it cannot
# be dropped.
#
# DANCEFLOOR_LED_MARKER_GPIO lives in the shared components/dancefloor_leds/
# Kconfig and needs nothing here either. Its default is 2, which on this board
# is pad D1 -- free, not a strapping pin, and in range. Wire an LED and a 330 R
# resistor to ground there.
#
# Do NOT point it at 21. That is documented as the onboard user LED and this
# file used to recommend it; it has since been seen not to light at all. Two
# candidate reasons, neither confirmed: the LED may not be on 21 on every board
# revision, and 21 is also the pin the Sense's SD slot reportedly uses for CS.
# It is active low as well, so even working it would read inverted against every
# other unit. An external LED on D1 avoids all three questions.

