apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Carried over, but NOT carried over on evidence
# ---------------------------------------------------------------------------
#
# Keep the lwIP tcpip thread off the core the LED tasks run on.
#
# On the classic hub this was the whole fix for render starvation: wake overshoot
# mean 2057 -> 634 us, pattern arithmetic max 23226 -> 5254 us, late frames
# 10 -> 0. Both parts of that reasoning still hold in principle -- the thread
# still runs at priority 18, above every task this firmware creates, core locking
# is still off so every sendto() blocks in that thread rather than in the caller,
# and this unit still drives ~30x the priority-18 work a satellite does.
#
# What does NOT carry over is the measurement. Those numbers were taken on a
# 240 MHz LX6 with esp-dsp's generic FFT; this is an LX7 with the SIMD path, and
# the starvation may be smaller, absent, or differently shaped. It is set here
# because it was right there and is unlikely to hurt, which is exactly the
# standard architecture.md's postscript says produced most of the wasted effort
# in this project.
#
# Before trusting it, run it both ways and read the vis log line. That is a
# measurement nobody has made on this part.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y

# ---------------------------------------------------------------------------
# Deliberately NOT set
# ---------------------------------------------------------------------------
#
# PSRAM. The board has 8 MB of octal PSRAM and this build leaves it off.
#
# It is tempting, because architecture.md S16 ends the burstiness wart at
# "fixing it properly means a smaller lead or a larger ring". But PSRAM is the
# wrong memory for a ring regardless, since the ring is touched from the
# playback path and cache misses there are the one thing that loop cannot
# absorb.
#
# And it is the wrong BOARD. The ring that bounds LEAD + RESYNC is the
# satellite's, and the satellite is a classic ESP32 with no PSRAM at all -- so
# no amount of memory on this unit buys the lead a single millisecond. That is
# the whole answer to "the S3 has plenty of PSRAM, can we not have a 500 ms
# lead": a 500 ms lead needs ~107 kB of satellite ring against a largest free
# block of 106 kB, and it would fail to allocate on the board that has to hold
# it.
#
# The larger ring the wart actually wanted has since been taken, in the
# satellite's internal SRAM, where it belongs: 64 -> 80 kB, which moved the
# bound from 320 ms against 372 to 350 against 464 and let RESYNC_US go from
# 120 to 150.
#
# Enabling it also costs: the octal interface eats GPIO 33-37 (not broken out,
# so no loss) and adds cache-miss jitter to every task, including the ones being
# measured. Turn it on only with a specific allocation in mind.
#
#   CONFIG_SPIRAM=y
#   CONFIG_SPIRAM_MODE_OCT=y
#   CONFIG_SPIRAM_SPEED_80M=y
